# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
minha_lista = [10,20,30]
keys = ['a', 'b', 'c']

In [3]:
serie = pd.Series(minha_lista, keys)
serie

a    10
b    20
c    30
dtype: int64

In [4]:
serie['a']

10

In [5]:
array = np.array(minha_lista)

In [6]:
serie2 = pd.Series(array, keys)
serie2

a    10
b    20
c    30
dtype: int32

Mutiplicidade de dados

In [7]:
valores = np.array(["maria", 2, 4.5])

serie3 = pd.Series(valores, keys)
serie3

a    maria
b        2
c      4.5
dtype: object

In [8]:
serie3['b']

'2'

In [9]:
serie4 = pd.Series(np.array([sum, map, filter]))
serie4

0    <built-in function sum>
1              <class 'map'>
2           <class 'filter'>
dtype: object

Operacoes com Series

In [10]:

ser = pd.Series([1,2,3], ['Brasil', 'EUA', 'Canada'])
ser

Brasil    1
EUA       2
Canada    3
dtype: int64

In [11]:
ser2 = pd.Series([1,2,3], ['Canada', 'Portugal', 'EUA'])
ser2

Canada      1
Portugal    2
EUA         3
dtype: int64

In [12]:
ser2+ ser

Brasil      NaN
Canada      4.0
EUA         5.0
Portugal    NaN
dtype: float64

# DataFrames

In [13]:
matriz = np.random.randint(1, 101, (3,3))
matriz

array([[43, 29, 51],
       [75, 83, 52],
       [88, 28, 79]])

In [14]:
tabela = pd.DataFrame(matriz, index=['A', 'B', 'C'], columns=['Manaus', 'Sp', 'Rio'])

In [15]:
tabela

   Manaus  Sp  Rio
A      43  29   51
B      75  83   52
C      88  28   79

In [16]:
tabela[['Rio']]

   Rio
A   51
B   52
C   79

In [17]:
tabela.loc[['A']]

   Manaus  Sp  Rio
A      43  29   51

In [18]:
tabela["Curitiba"] = tabela['Rio'] + tabela['Sp']

In [19]:
tabela

   Manaus  Sp  Rio  Curitiba
A      43  29   51        80
B      75  83   52       135
C      88  28   79       107

In [20]:
tabela.drop("Curitiba", axis=1, inplace=True)
tabela

   Manaus  Sp  Rio
A      43  29   51
B      75  83   52
C      88  28   79

In [21]:
tabela.loc[['A', 'B'], ["Rio", "Manaus"]]

   Rio  Manaus
A   51      43
B   52      75

In [22]:
tabela.iloc[0:2,] #localizar por index

   Manaus  Sp  Rio
A      43  29   51
B      75  83   52

Fazendo filtros

In [23]:
#cedulas que forem maior que 50
tabela[tabela>50]

   Manaus    Sp  Rio
A     NaN   NaN   51
B    75.0  83.0   52
C    88.0   NaN   79

In [24]:
#filtrar > 50 em Sp
tabela[tabela["Sp"]>50]

   Manaus  Sp  Rio
B      75  83   52

In [25]:
#filtrar em Manaus < 80 e só mostrar essas classes do Rio

tabela[tabela["Manaus"]<80][["Rio"]]

   Rio
A   51
B   52

Condição multipla

In [26]:
#filtrar Manaus<80 e Rio < 80

tabela[ (tabela["Manaus"]<80) & (tabela["Rio"]<80)  ][["Manaus", "Rio"]]  # condicional OR ==> |

   Manaus  Rio
A      43   51
B      75   52

Usando indices

In [27]:
tabela.reset_index()

  index  Manaus  Sp  Rio
0     A      43  29   51
1     B      75  83   52
2     C      88  28   79

In [28]:
tabela # so altera a tabela original com inplace=true

   Manaus  Sp  Rio
A      43  29   51
B      75  83   52
C      88  28   79

In [29]:
novos_index =  "Ricos Medios Pobres".split()

tabela["Classe"] = novos_index

In [30]:
tabela

   Manaus  Sp  Rio  Classe
A      43  29   51   Ricos
B      75  83   52  Medios
C      88  28   79  Pobres

In [31]:
tabela.set_index("Classe", inplace=True)
tabela

        Manaus  Sp  Rio
Classe
Ricos       43  29   51
Medios      75  83   52
Pobres      88  28   79

Indices Multiniveis

In [32]:
outside = "G1 G1 G2 G2".split(" ")
inside = [1,1,2,2]

hier_index = list(zip(outside, inside)) #faz a junção de tuplas
hier_index

[('G1', 1), ('G1', 1), ('G2', 2), ('G2', 2)]

In [33]:
hier_index = pd.MultiIndex.from_tuples(hier_index) #transforma para Pandas
hier_index

MultiIndex([('G1', 1),
            ('G1', 1),
            ('G2', 2),
            ('G2', 2)],
           )

In [34]:
lista = np.zeros((4,1))
tabela2 = pd.DataFrame(lista, index = hier_index)
tabela2

        0
G1 1  0.0
   1  0.0
G2 2  0.0
   2  0.0

In [35]:
# --------------- Aplicacao pratica ---------

listaA = ["Amazonas", "Amazonas", "Pernambuco", "Pernambuco"]
listaB = ["Interior", "Capital", "Interior", "Capital"]

tuplas_index = list(zip(listaA, listaB))
tuplas_index = pd.MultiIndex.from_tuples(tuplas_index)

dadosAle = np.random.randint(30,101, (4,3))
dadosAle

array([[ 33,  84,  96],
       [ 63,  71,  52],
       [ 75,  88, 100],
       [ 69,  87,  68]])

In [36]:

tabelaReal = pd.DataFrame(dadosAle, index=tuplas_index, columns=["Segurança", "Saude", "Educação"])
tabelaReal

                     Segurança  Saude  Educação
Amazonas   Interior         33     84        96
           Capital          63     71        52
Pernambuco Interior         75     88       100
           Capital          69     87        68

In [37]:
tabelaReal.xs("Amazonas")

          Segurança  Saude  Educação
Interior         33     84        96
Capital          63     71        52

In [38]:
tabelaReal.index.names = ["Estado", "Divisão"]

In [39]:
tabelaReal

                     Segurança  Saude  Educação
Estado     Divisão
Amazonas   Interior         33     84        96
           Capital          63     71        52
Pernambuco Interior         75     88       100
           Capital          69     87        68

# Tratando Dados Ausentes

In [40]:
d1 = np.random.rand(4,4)
d1

array([[0.96921367, 0.3611497 , 0.31104575, 0.21203884],
       [0.45546154, 0.3531154 , 0.62921831, 0.41924722],
       [0.93215015, 0.4301143 , 0.83139776, 0.92472229],
       [0.73075392, 0.13992762, 0.35383046, 0.21609764]])

In [41]:
d1[1, 1:] = np.nan
d1[3, 1] = np.nan
d1[0,0] = np.nan

In [42]:
tabela = pd.DataFrame(d1)
tabela

          0         1         2         3
0       NaN  0.361150  0.311046  0.212039
1  0.455462       NaN       NaN       NaN
2  0.932150  0.430114  0.831398  0.924722
3  0.730754       NaN  0.353830  0.216098

In [43]:
tabela.dropna() #retira todas as linhas com NaN

         0         1         2         3
2  0.93215  0.430114  0.831398  0.924722

In [44]:
tabela

          0         1         2         3
0       NaN  0.361150  0.311046  0.212039
1  0.455462       NaN       NaN       NaN
2  0.932150  0.430114  0.831398  0.924722
3  0.730754       NaN  0.353830  0.216098

In [45]:
tabela.dropna(thresh=2) #so retira as linhas com NaN>=n, thresh=n

          0         1         2         3
0       NaN  0.361150  0.311046  0.212039
2  0.932150  0.430114  0.831398  0.924722
3  0.730754       NaN  0.353830  0.216098

In [46]:
tabela["Tipo"] = ["A", "B", "C", "D"]
tabela

          0         1         2         3 Tipo
0       NaN  0.361150  0.311046  0.212039    A
1  0.455462       NaN       NaN       NaN    B
2  0.932150  0.430114  0.831398  0.924722    C
3  0.730754       NaN  0.353830  0.216098    D

In [47]:
tabela.set_index("Tipo", inplace=True)
tabela

             0         1         2         3
Tipo
A          NaN  0.361150  0.311046  0.212039
B     0.455462       NaN       NaN       NaN
C     0.932150  0.430114  0.831398  0.924722
D     0.730754       NaN  0.353830  0.216098

In [48]:
tabela.loc['D'].fillna(value="oi")

0    0.730754
1          oi
2     0.35383
3    0.216098
Name: D, dtype: object

In [49]:
tabela

             0         1         2         3
Tipo
A          NaN  0.361150  0.311046  0.212039
B     0.455462       NaN       NaN       NaN
C     0.932150  0.430114  0.831398  0.924722
D     0.730754       NaN  0.353830  0.216098

In [50]:
tabela.fillna(method="ffill") #preenche com o de cima

             0         1         2         3
Tipo
A          NaN  0.361150  0.311046  0.212039
B     0.455462  0.361150  0.311046  0.212039
C     0.932150  0.430114  0.831398  0.924722
D     0.730754  0.430114  0.353830  0.216098

# GroupBy

In [51]:
dados = { "Nome":["Maria", "Lucas", "Mario", "Carla", "Luisa", "Jorge", "Marcia"],
         "Produto":["Avon", "Boticario", "Jequiti", "Jequiti", "Avon", "Boticario", "Natura"],
         "Venda":[1200, 3000, 500, 1000, 200, 300, 200]}

In [52]:
tabelaGB = pd.DataFrame(dados)

In [53]:
tabelaGB

     Nome    Produto  Venda
0   Maria       Avon   1200
1   Lucas  Boticario   3000
2   Mario    Jequiti    500
3   Carla    Jequiti   1000
4   Luisa       Avon    200
5   Jorge  Boticario    300
6  Marcia     Natura    200

In [54]:
grupo = tabelaGB.groupby("Produto")

In [55]:
grupo

In [56]:
grupo.sum()

           Venda
Produto
Avon        1400
Boticario   3300
Jequiti     1500
Natura       200

In [57]:
grupo.describe()

          Venda
          count    mean          std    min    25%     50%     75%     max
Produto
Avon        2.0   700.0   707.106781  200.0  450.0   700.0   950.0  1200.0
Boticario   2.0  1650.0  1909.188309  300.0  975.0  1650.0  2325.0  3000.0
Jequiti     2.0   750.0   353.553391  500.0  625.0   750.0   875.0  1000.0
Natura      1.0   200.0          NaN  200.0  200.0   200.0   200.0   200.0

In [58]:
grupo.count()

           Nome  Venda
Produto
Avon          2      2
Boticario     2      2
Jequiti       2      2
Natura        1      1

# Mesclar, juntar e concatenar

In [59]:
data1 = { "A": ["A0", "A1","A2"], "B": ["B0", "B1","B2"], "C": ["C0", "C1","C2"]  }

data2 = { "A": ["A3", "A4","A5"], "B": ["B3", "B4","B5"], "C": ["C3", "C4","C5"]  }

data3 = { "A": ["A6", "A7","A8"], "B": ["B6", "B7","B8"], "C": ["C6", "C7","C8"]  }

d1 = pd.DataFrame(data1, index=[0,1,2])
d2 = pd.DataFrame(data2, index=[3,4,5])
d3 = pd.DataFrame(data3, index=[6,7,8])

In [60]:
d1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [61]:
d2

    A   B   C
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

In [62]:
d3

    A   B   C
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [63]:
pd.concat([d1, d2, d3])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [64]:
pd.concat([d1, d2, d3], axis=1)

     A    B    C    A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8

In [65]:
dataA = { "A": ["A0","A1", "A2"], "B":["B0", "B1", "B2"], "key":["K0","K1","K2"]}
dataB = { "C": ["C0","C1","C2"], "key": ["K0", "K1","K2"], "D":["D0","D1","D2"]}

tabA = pd.DataFrame(dataA)
tabB = pd.DataFrame(dataB)

In [66]:
tabA

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

In [67]:
tabB

    C key   D
0  C0  K0  D0
1  C1  K1  D1
2  C2  K2  D2

In [68]:
pd.merge(tabA, tabB, on="key")

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [69]:
dataC = { "C": ["C0","C1","C2"], "key":["K0","K1","K2"], "key2": ["K0","K1", "K0" ]}
dataD = { "D": ["D0","D1","D2"], "key":["K0","K1","K2"], "key2": ["K0","K0", "K0" ]}

tabC = pd.DataFrame(dataC)
tabC

    C key key2
0  C0  K0   K0
1  C1  K1   K1
2  C2  K2   K0

In [70]:
tabD = pd.DataFrame(dataD)
tabD

    D key key2
0  D0  K0   K0
1  D1  K1   K0
2  D2  K2   K0

In [71]:
pd.merge(tabC, tabD, on=["key", "key2"]) #retira a linha onde o merge não é igual

    C key key2   D
0  C0  K0   K0  D0
1  C2  K2   K0  D2

In [72]:
pd.merge(tabC, tabD, how ="outer", on=["key", "key2"]) #inclue tudo

     C key key2    D
0   C0  K0   K0   D0
1   C1  K1   K1  NaN
2   C2  K2   K0   D2
3  NaN  K1   K0   D1

In [73]:
d1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [74]:
dA = { "D": ["D0", "D1"]}
dA = pd.DataFrame(dA)

In [75]:
dA

    D
0  D0
1  D1

In [76]:
d1.join(dA)

    A   B   C    D
0  A0  B0  C0   D0
1  A1  B1  C1   D1
2  A2  B2  C2  NaN

# Operações

In [77]:
dados = { "A":[1,2,3,4], "B":[444,543,444,555], "C":["abc","cde","efg","jkl"]}
tabOp = pd.DataFrame(dados)
tabOp

   A    B    C
0  1  444  abc
1  2  543  cde
2  3  444  efg
3  4  555  jkl

In [78]:
tabOp['B'].value_counts()

444    2
543    1
555    1
Name: B, dtype: int64

In [79]:
del tabOp['C']

In [80]:
tabOp

   A    B
0  1  444
1  2  543
2  3  444
3  4  555

In [81]:
tabOp.sort_values(by="B")

   A    B
0  1  444
2  3  444
1  2  543
3  4  555

In [82]:
tabOp.isnull()

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

# Entrada e saída

In [83]:
df = pd.read_excel("planilha-exemplo.xlsx")

In [84]:
df

  Amazonas   94  26
0     Para   23  45
1    Bahia   89  67
2   Parana   56  90
3    Ceara  100  34

In [85]:
row1 = df.columns[0]
row2 = df.columns[1]
row3 = df.columns[2]

In [86]:
df.loc[4] = [row1, row2, row3]

In [87]:
df

   Amazonas   94  26
0      Para   23  45
1     Bahia   89  67
2    Parana   56  90
3     Ceara  100  34
4  Amazonas   94  26

In [88]:
df.columns = ["Estado", "Saude", "Segurança"]

In [89]:
df

     Estado  Saude  Segurança
0      Para     23         45
1     Bahia     89         67
2    Parana     56         90
3     Ceara    100         34
4  Amazonas     94         26

In [90]:
df.to_excel("planilha-alterada.xlsx")

In [91]:
import lxml

In [92]:
falidos = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")

In [96]:
falidos[0].head() #guarda no 0

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 18, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

In [97]:
falidos = falidos[0]

In [99]:
falidos[["Bank Name"]]

                                             Bank Name
0                                 The Enloe State Bank
1                  Washington Federal Bank for Savings
2      The Farmers and Merchants State Bank of Argonia
3                                  Fayette County Bank
4    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...
..                                                 ...
551                                 Superior Bank, FSB
552                                Malta National Bank
553                    First Alliance Bank & Trust Co.
554                  National State Bank of Metropolis
555                                   Bank of Honolulu

[556 rows x 1 columns]